public/shipping/loomis_18.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.rating.uss.transforce.ca" xmlns:xsd="http://ws.rating.uss.transforce.ca/xsd" xmlns:xsd1="http://dto.uss.transforce.ca/xsd"><soapenv:Header/><soapenv:Body><ws:getRates><ws:request><xsd:password>vs6Dp5Iw</xsd:password><xsd:user_id>LSHIPM34538@GLACANADA.COM</xsd:user_id><xsd:shipment><xsd1:delivery_address_line_1>170 Zenway Blvd. Unit 2</xsd1:delivery_address_line_1><xsd1:delivery_city>Woodbridge</xsd1:delivery_city><xsd1:delivery_country>CA</xsd1:delivery_country><xsd1:delivery_name>Golden Leaf Automotive.</xsd1:delivery_name><xsd1:delivery_postal_code>L4H2Y7</xsd1:delivery_postal_code><xsd1:delivery_province>ON</xsd1:delivery_province><xsd1:dimension_unit>I</xsd1:dimension_unit><xsd1:packages><xsd1:package_info_num><xsd1:name>LENGTH</xsd1:name><xsd1:value>5</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>WIDTH</xsd1:name><xsd1:value>3</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>HEIGHT</xsd1:name><xsd1:value>2</xsd1:value></xsd1:package_info_num><xsd1:reported_weight>1</xsd1:reported_weight></xsd1:packages><xsd1:packages><xsd1:package_info_num><xsd1:name>LENGTH</xsd1:name><xsd1:value>5</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>WIDTH</xsd1:name><xsd1:value>3</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>HEIGHT</xsd1:name><xsd1:value>2</xsd1:value></xsd1:package_info_num><xsd1:reported_weight>1</xsd1:reported_weight></xsd1:packages><xsd1:packages><xsd1:package_info_num><xsd1:name>LENGTH</xsd1:name><xsd1:value>5</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>WIDTH</xsd1:name><xsd1:value>3</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>HEIGHT</xsd1:name><xsd1:value>2</xsd1:value></xsd1:package_info_num><xsd1:reported_weight>1</xsd1:reported_weight></xsd1:packages><xsd1:packages><xsd1:package_info_num><xsd1:name>LENGTH</xsd1:name><xsd1:value>5</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>WIDTH</xsd1:name><xsd1:value>3</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>HEIGHT</xsd1:name><xsd1:value>2</xsd1:value></xsd1:package_info_num><xsd1:reported_weight>1</xsd1:reported_weight></xsd1:packages><xsd1:packages><xsd1:package_info_num><xsd1:name>LENGTH</xsd1:name><xsd1:value>5</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>WIDTH</xsd1:name><xsd1:value>3</xsd1:value></xsd1:package_info_num><xsd1:package_info_num><xsd1:name>HEIGHT</xsd1:name><xsd1:value>2</xsd1:value></xsd1:package_info_num><xsd1:reported_weight>1</xsd1:reported_weight></xsd1:packages><xsd1:pickup_address_line_1>67 Garland Crescent</xsd1:pickup_address_line_1><xsd1:pickup_city>Montreal</xsd1:pickup_city><xsd1:pickup_name>Len Len</xsd1:pickup_name><xsd1:pickup_postal_code>L4A1B2</xsd1:pickup_postal_code><xsd1:pickup_province>ON</xsd1:pickup_province><xsd1:reported_weight_unit>L</xsd1:reported_weight_unit><xsd1:service_type>DD</xsd1:service_type><xsd1:shipper_num>M34538</xsd1:shipper_num><xsd1:shipper_date>2019-01-10</xsd1:shipper_date></xsd:shipment></ws:request></ws:getRates></soapenv:Body></soapenv:Envelope>
